* მონაცემთა ტიპები (data types)
** console.log()
#+NAME: console.log
#+BEGIN_SRC js

console.log();
console.log();
console.log();
console.log(console.log());

#+END_SRC

#+RESULTS: console.log
: 
: 
: 
: 
: undefined
: undefined


** undefined (განუსაზღვრელი)
#+NAME: undefined
#+BEGIN_SRC js

// One type of value: undefined
console.log(undefined);

#+END_SRC

#+RESULTS: undefined
: undefined
: undefined

** null
#+NAME: null
#+BEGIN_SRC js

// One type of value: null
console.log(null);

#+END_SRC

#+RESULTS: null
: null
: undefined



** boolean (ლოგიკური ღირებულება)
#+NAME: boolean
#+BEGIN_SRC js

// Two types of values: true, false
console.log(true);
console.log(false);
console.log(typeof true);

#+END_SRC

#+RESULTS: boolean
: true
: false
: boolean
: undefined


** string (ტექსტი)
#+NAME: string
#+BEGIN_SRC js

// Text surrounded by quotes "" or '' or ``
console.log("ტექსტი");
console.log('სხვა ტექსტი');
console.log(`string with backticks`);
console.log(typeof "დაბრუნებული ტექსტი");

#+END_SRC

#+RESULTS: string
: ტექსტი
: სხვა ტექსტი
: string with backticks
: string
: undefined



** symbol (სიმბოლო)
#+NAME: symbol
#+BEGIN_SRC js

// created with Symbol() function
console.log(Symbol("ტექსტი"));
console.log(typeof Symbol('returned symbol'));

#+END_SRC

#+RESULTS: symbol
: Symbol(ტექსტი)
: symbol
: undefined


** bigint (დიდი მთელი რიცხვი)
#+NAME: bigint
#+BEGIN_SRC js

// created with BigInt() function or integer with n at the end
console.log(BigInt(-499003));
console.log(typeof 4892829048238947n);

#+END_SRC

#+RESULTS: bigint
: -499003n
: bigint
: undefined


** number (რიცხვი)
#+NAME: number
#+BEGIN_SRC js


console.log(5900492);
console.log(-59384989349094);
console.log(6004.4793);
console.log(typeof 4.4);

#+END_SRC

#+RESULTS: number
: 5900492
: -59384989349094
: 6004.4793
: number
: undefined

** object (ობიექტი)
#+NAME: object
#+BEGIN_SRC js


console.log(typeof {});
console.log(
  {
    type: "object",
    properties: 3,
    isMutable: true
  }
);
console.log(typeof {x: 30, y: 50});

#+END_SRC

#+RESULTS: object
: object
: { type: 'object', properties: 3, isMutable: true }
: object
: undefined

